app/views/shared/_stats.html.erb

SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = $1  [["user_id", 2]]
---
    <strong id="following" class="stat">
      <%= @user.items.count %>